w1 = 'अंघोळीची'
l1= ['च', 'ी', 'ीचं', 'ीचा', 'ीची', 'ीचे', 'ीच्या', 'ीत', 'ीनंतर', 'ीला', 'ीलाही', 'ीसाठी', 'ीसारखी', 'ीहून']


w2 = 'अंदाजपत्रकाएवढीच'
l2=['ांच्या', 'ाएवढीच', 'ाचा', 'ाचे', 'ात', 'ातील', 'ाद्वारे']



w3= 'अंधाराचा'
l3= ['लेला', 'लेली', 'लेले', 'लेल्या', 'ल्या','ही', 'ाकडून', 'ाकडे', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाचेच', 'ाच्या', 'ात', 'ातच', 'ातली', 'ातल्या', 'ातसुद्धा', 'ातही', 'ातील', 'ातीलच', 'ातून', 'ानंतर', 'ापासून', 'ापेक्षासुद्धा', 'ामधून', 'ामुळे', 'ाला', 'ावर', 'ाशिवाय', 'ाशी', 'ी', 'ून']


ll =[  'ही', 'ांचा', 'ांची', 'ांचे', 'ांच्या', 'ांतर्गत', 'ांपासून', 'ांबद्दल', 'ांबरोबरच', 'ांमध्ये', 'ांवर', 'ांसंबंधीची', 'ांसाठी', 'ाखाली', 'ाखालील', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातली', 'ातील', 'ातून', 'ानं', 'ानुसार', 'ाने', 'ान्वये', 'ाबरोबर', 'ाबाबत', 'ामुळे', 'ाला', 'ावर', 'ाविषयी', 'ासंबंधातील', 'ासंबंधी', 'ासाठी', 'ासारखी', 'िता', 'ितेच्या', 'ी', 'ीगण', 'ीच', 'ीदेखील', 'ीपदाचा', 'ीपदी', 'ीसुद्धा', 'ीही', 'ी', 'ीचं', 'ीचा', 'ीची', 'ीचे', 'ीच्या', 'ीत', 'ीनंतर', 'ीला', 'ीलाही', 'ीसाठी', 'ीसारखी', 'ीहून','ांच्या', 'ाएवढीच', 'ाचा', 'ाचे', 'ात', 'ातील', 'ाद्वारे', 'लेला', 'लेली', 'लेले', 'लेल्या', 'ल्या','ाकडून', 'ाकडे', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाचेच', 'ाच्या', 'ात', 'ातच', 'ातली', 'ातल्या', 'ातसुद्धा', 'ातही', 'ातील', 'ातीलच', 'ातून', 'ानंतर', 'ापासून', 'ापेक्षासुद्धा', 'ामधून', 'ामुळे', 'ाला', 'ावर', 'ाशिवाय', 'ाशी',  'ून', 'ांखाली', 'ांचा', 'ांची', 'ांचीच', 'ांचे', 'ांच्या', 'ांनी','ांपेक्षा', 'ांवर', 'ांवरून', 'ांहून', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातच', 'ातला', 'ातून', 'ात्मक', 'ानी', 'ाने', 'ापेक्षा', 'ामधे', 'ामध्ये', 'ाला', 'ावर', 'ावरून', 'ाच', 'ाय', 'ी', 'ीच', 'ीस', 'े', 'ेत', 'ेलं', 'ेला', 'ेली', 'ेले', 'ेलो', 'ेल्या', 'ेल्यांचा', 'ेल्यांची', 'ेल्यांना',  'ोय', '्या', '्याची', '्याचे', '्याने', '्यामुळे', '्यावर', '्यासारखं', '्यासारखा', '्यासारखी', '्यासारखे', 'णारी', 'णारे', 'णाऱ्या',   'तात', 'तील',  'तोय', 'लं', 'लंय',  'लात',  'लेला', 'लेली', 'लेले', 'लेल्या','ल्याने', 'ींकडे', 'ींचा', 'ींची', 'ींचे', 'ींच्या', 'ींतील', 'ींतून', 'ींना', 'ींनी', 'ींपासून', 'ींपुढे', 'ींबद्दल', 'ींबाबत', 'ींमुळे', 'ींमुळेच', 'ींवर', 'ीचं', 'ीचा', 'ीची', 'ीचीच', 'ीचे', 'ीचेच', 'ीच्या', 'ीत', 'ीतच', 'ीतून', 'ीनंतर', 'ीमुळे', 'ीला', 'ीवर', 'ीही', 'ांचा', 'ांची', 'ांचे', 'ांच्या', 'ांतर्गत', 'ांपासून', 'ांबद्दल', 'ांबरोबरच', 'ांमध्ये', 'ांवर', 'ांसंबंधीची', 'ांसाठी', 'ाखाली', 'ाखालील', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातली', 'ातील', 'ातून', 'ानं', 'ानुसार', 'ाने', 'ान्वये', 'ाबरोबर', 'ाबाबत', 'ामुळे', 'ाला', 'ावर', 'ाविषयी', 'ासंबंधातील', 'ासंबंधी', 'ासाठी', 'ासारखी', 'िता', 'ितेच्या', 'ीगण', 'ीच', 'ीदेखील', 'ीपदाचा', 'ीपदी', 'ीसुद्धा', 'ीही', ]



w4= 'अंशाची'
l4 =[ 'कालीन', 'तः', 'धारी', 'मात्र', 'ही', 'ांखाली', 'ांचा', 'ांची', 'ांचीच', 'ांचे', 'ांच्या', 'ांनी','ांपेक्षा', 'ांवर', 'ांवरून', 'ांहून', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातच', 'ातला', 'ातून', 'ात्मक', 'ानी', 'ाने', 'ापेक्षा', 'ामधे', 'ामध्ये', 'ाला', 'ावर', 'ावरून', 'ी', ]

w5 = 'अडकल्यासारखा'
l5 = ['ा', 'ाच', 'ाय', 'ी', 'ीच', 'ीस', 'े', 'ेत', 'ेलं', 'ेला', 'ेली', 'ेले', 'ेलो', 'ेल्या', 'ेल्यांचा', 'ेल्यांची', 'ेल्यांना', 'ो', 'ोय', '्या', '्याची', '्याचे', '्याने', '्यामुळे', '्यावर', '्यासारखं', '्यासारखा', '्यासारखी', '्यासारखे']



w6 = 'अडकवायचेच'
l6 = ['णार', 'णारी', 'णारे', 'णाऱ्या',  'त', 'तात', 'तील', 'तो', 'तोय', 'लं', 'लंय', 'ला', 'लात', 'ली', 'ले', 'लेला', 'लेली', 'लेले', 'लेल्या','ल्याने']

w7 ='अडकवणे'
l7 = [ 'ार', 'ारी', 'ारे', 'ाऱ्या', 'े', '्याचा', '्याचाही', '्याची', '्याचे', '्यात', '्यासाठी']

w8 = 'अडचणीनंतर'
l8 = [ 'च', 'ही', 'ी', 'ींकडे', 'ींचा', 'ींची', 'ींचे', 'ींच्या', 'ींतील', 'ींतून', 'ींना', 'ींनी', 'ींपासून', 'ींपुढे', 'ींबद्दल', 'ींबाबत', 'ींमुळे', 'ींमुळेच', 'ींवर', 'ीचं', 'ीचा', 'ीची', 'ीचीच', 'ीचे', 'ीचेच', 'ीच्या', 'ीत', 'ीतच', 'ीतून', 'ीनंतर', 'ीमुळे', 'ीला', 'ीवर', 'ीही',]


w9 = 'अधिकारानुसार'
l9 =[  'ही', 'ांचा', 'ांची', 'ांचे', 'ांच्या', 'ांतर्गत', 'ांपासून', 'ांबद्दल', 'ांबरोबरच', 'ांमध्ये', 'ांवर', 'ांसंबंधीची', 'ांसाठी', 'ाखाली', 'ाखालील', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातली', 'ातील', 'ातून', 'ानं', 'ानुसार', 'ाने', 'ान्वये', 'ाबरोबर', 'ाबाबत', 'ामुळे', 'ाला', 'ावर', 'ाविषयी', 'ासंबंधातील', 'ासंबंधी', 'ासाठी', 'ासारखी', 'िता', 'ितेच्या', 'ी', 'ीगण', 'ीच', 'ीदेखील', 'ीपदाचा', 'ीपदी', 'ीसुद्धा', 'ीही', ]


#from combinations import combine_dict_alpha
dict_a = ['अ' , 'आ' ,'अॅ',  'ऑ',  'ऒ', 'ओ', 'औ', 'अं', 'अः']


import csv
xx = 'आईवडिलांसम्वेत'

pattern = w5[0:6]
print(pattern)

sl = list()
for i in dict_a:
    if i == w2[0]:
        with open('alpha/a.csv', newline='') as dict_File:
            reader_d = csv.DictReader(dict_File)
            for row in reader_d:
                if pattern in row['word']:
                    print(row)
                    a = row['word']
                    stem = a[6:]
                    sl.append(stem)
                            
print(sl)



#####################################################################
####################################################################

large = list()
large= ['च', 'ी', 'ीचं', 'ीचा', 'ीची', 'ीचे', 'ीच्या']

for i in l3:
    for j in range(len(large)):
        if i!=large[j] and j==len(large)-1:

            large.append(i)
        else:
            pass


print(large)

