ll =[  'ही', 'ांचा', 'ांची', 'ांचे', 'ांच्या', 'ांतर्गत', 'ांपासून', 'ांबद्दल', 'ांबरोबरच', 'ांमध्ये', 'ांवर', 'ांसंबंधीची', 'ांसाठी', 'ाखाली',
     'ाखालील', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातली', 'ातील', 'ातून', 'ानं', 'ानुसार', 'ाने', 'ान्वये', 'ाबरोबर', 'ाबाबत',
     'ामुळे', 'ाला', 'ावर', 'ाविषयी', 'ासंबंधातील', 'ासंबंधी', 'ासाठी', 'ासारखी', 'िता', 'ितेच्या', 'ी', 'ीगण', 'ीच', 'ीदेखील', 'ीपदाचा', 
     'ीपदी', 'ीसुद्धा', 'ीही', 'ी', 'ीचं', 'ीचा', 'ीची', 'ीचे', 'ीच्या', 'ीत', 'ीनंतर', 'ीला', 'ीलाही', 'ीसाठी', 'ीसारखी', 'ीहून','ांच्या',
     'ाएवढीच', 'ाचा', 'ाचे', 'ात', 'ातील', 'ाद्वारे', 'लेला', 'लेली', 'लेले', 'लेल्या', 'ल्या','ाकडून', 'ाकडे', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाचेच',
     'ाच्या', 'ात', 'ातच', 'ातली', 'ातल्या', 'ातसुद्धा', 'ातही', 'ातील', 'ातीलच', 'ातून', 'ानंतर', 'ापासून', 'ापेक्षासुद्धा', 'ामधून', 
     'ामुळे', 'ाला', 'ावर', 'ाशिवाय', 'ाशी',  'ून', 'ांखाली', 'ांचा', 'ांची', 'ांचीच', 'ांचे', 'ांच्या', 'ांनी','ांपेक्षा', 'ांवर', 'ांवरून', 
     'ांहून', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातच', 'ातला', 'ातून', 'ात्मक', 'ानी', 'ाने', 'ापेक्षा', 'ामधे', 'ामध्ये', 'ाला',
     'ावर', 'ावरून', 'ाच', 'ाय', 'ी', 'ीच', 'ीस', 'े', 'ेत', 'ेलं', 'ेला', 'ेली', 'ेले', 'ेलो', 'ेल्या', 'ेल्यांचा', 'ेल्यांची', 'ेल्यांना', 
     'ोय', '्या', '्याची', '्याचे', '्याने', '्यामुळे', '्यावर', '्यासारखं', '्यासारखा', '्यासारखी', '्यासारखे', 'णारी', 'णारे', 'णाऱ्या',  
     'तात', 'तील',  'तोय', 'लं', 'लंय',  'लात',  'लेला', 'लेली', 'लेले', 'लेल्या','ल्याने', 'ींकडे', 'ींचा', 'ींची', 'ींचे', 'ींच्या', 'ींतील', 'ींतून', 'ींना',
     'ींनी', 'ींपासून', 'ींपुढे', 'ींबद्दल', 'ींबाबत', 'ींमुळे', 'ींमुळेच', 'ींवर', 'ीचं', 'ीचा', 'ीची', 'ीचीच', 'ीचे', 'ीचेच', 'ीच्या', 'ीत', 
     'ीतच', 'ीतून', 'ीनंतर', 'ीमुळे', 'ीला', 'ीवर', 'ीही', 'ांचा', 'ांची', 'ांचे', 'ांच्या', 'ांतर्गत', 'ांपासून', 'ांबद्दल', 'ांबरोबरच',
     'ांमध्ये', 'ांवर', 'ांसंबंधीची', 'ांसाठी', 'ाखाली', 'ाखालील', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातली', 'ातील', 'ातून',
     'ानं', 'ानुसार', 'ाने', 'ान्वये', 'ाबरोबर', 'ाबाबत', 'ामुळे', 'ाला', 'ावर', 'ाविषयी', 'ासंबंधातील', 'ासंबंधी', 'ासाठी', 'ासारखी',
     'िता', 'ितेच्या', 'ीगण', 'ीच', 'ीदेखील', 'ीपदाचा', 'ीपदी', 'ीसुद्धा', 'ीही', ]


w10 = ['पुरस्कृत', 'बुक', 'रेट', 'रेटचा', 'र्स', 'ांकडून', 'ांकडे', 'ांचा', 'ांचाही', 'ांची', 'ांचे', 'ांच्या', 'ांत', 'ांतर्फे', 'ांतील', 'ांतून',
       'ांना', 'ांनाही', 'ांनी', 'ांनीही', 'ांपेक्षा', 'ांपैकी', 'ांप्रमाणे', 'ांबरोबर', 'ांमधली', 'ांमधील', 'ांमधून', 'ांमध्ये', 'ांमार्फत', 'ांवर', 
       'ांशिवाय', 'ांशी', 'ांसाठी', 'ात', 'ातून', 'ामधील', 'ामधून', 'ामध्ये', 'ावर', 'िंग', 'िंगचा', 'िंगची', 'िंगचे', 'िंगच्या', 'िंगपर्यंत', 
       'िंगपासून', 'िंगमधील', 'िंगमध्ये', 'िंगशी', 'िंगसंबंधी', 'िंगसाठी', 'ींग', 'ेऐवजी', 'ेकडील', 'ेकडून', 'ेकडूनही', 'ेकडे', 'ेचं', 'ेचा', 
       'ेची', 'ेचे', 'ेच्या', 'ेजवळील', 'ेत', 'ेतच', 'ेतर्फे', 'ेतलं', 'ेतली', 'ेतल्या', 'ेतही', 'ेतील', 'ेतून', 'ेनं', 'ेने', 'ेनेही', 'ेपाशी',
       'ेबद्दल', 'ेबरोबर', 'ेमध्ये', 'ेमार्फत', 'ेला', 'ेवर', 'ेवरच', 'ेवरही', 'ेवरील', 'ेशिवाय', 'ेशी', 'ेस', 'ेसंबंधी', 'ेसमोरच', 'ेसाठी', 
       'ेसारख्या', 'ॉक', 'ॉकमध्ये', 'ॉकहून', '्स', '', 'च', 'पुरस्कृत', 'बुक', 'रेट', 'रेटचा', 'र्स', 'ा', 'ांकडून', 'ांकडे', 'ांचा', 'ांचाही', 'ांची',
       'ांचे', 'ांच्या', 'ांत', 'ांतर्फे', 'ांतील', 'ांतून', 'ांना', 'ांनाही', 'ांनी', 'ांनीही', 'ांपेक्षा', 'ांपैकी', 'ांप्रमाणे', 'ांबरोबर', 'ांमधली', 
       'ांमधील', 'ांमधून', 'ांमध्ये', 'ांमार्फत', 'ांवर', 'ांशिवाय', 'ांशी', 'ांसाठी', 'ात', 'ातून', 'ामधील', 'ामधून', 'ामध्ये', 'ावर', 
       'िंग', 'िंगचा', 'िंगची', 'िंगचे', 'िंगच्या', 'िंगपर्यंत', 'िंगपासून', 'िंगमधील', 'िंगमध्ये', 'िंगशी', 'िंगसंबंधी', 'िंगसाठी', 'ींग', 
       'ेऐवजी', 'ेकडील', 'ेकडून', 'ेकडूनही', 'ेकडे', 'ेचं', 'ेचा', 'ेची', 'ेचे', 'ेच्या', 'ेजवळील', 'ेत', 'ेतच', 'ेतर्फे', 'ेतलं', 'ेतली',
       'ेतल्या', 'ेतही', 'ेतील', 'ेतून', 'ेनं', 'ेने', 'ेनेही', 'ेपाशी', 'ेबद्दल', 'ेबरोबर', 'ेमध्ये', 'ेमार्फत', 'ेला', 'ेवर', 'ेवरच', 'ेवरही', 
       'ेवरील', 'ेशिवाय', 'ेशी', 'ेस', 'ेसंबंधी', 'ेसमोरच', 'ेसाठी', 'ेसारख्या', 'ॉक', 'ॉकमध्ये', 'ॉकहून', ]



reduced = ['ला', 'िंग', 'िंगसंबंधी', 'ॉकहून', 'ेवरच', 'िंगचे', 'ांमधून', 'ींग', 'ेचं', 'ेचा', 'ेनं', 'ेच्या', 'ांबरोबर', 'ेपाशी',
           'ांमध्ये', 'ातून', 'ांनाही', 'िंगशी', 'ेकडे', 'ांप्रमाणे', 'ांतर्फे', 'ेतील', 'ेतर्फे', 'ांना', 'ामध्ये', 'ात', 'ेवरही', 'ांमधील', 
           'ेसारख्या', 'ांतून', 'ांमार्फत', 'ेतलं', 'ा', 'ेसमोरच', 'बुक', 'िंगची', 'िंगमधील', 'ांचा', 'ेकडील', 'िंगच्या', 'ेतच', 'ेत', 'ेकडून', 
           'ेनेही', 'ांकडे', 'ेसाठी', 'ेकडूनही', 'ांमधली', 'ांचाही', 'ांत', 'ांशी', 'ांसाठी', 'िंगमध्ये', 'ेची', '्स', 'ेशिवाय', 'िंगपर्यंत', 'ेबद्दल',
           'ांच्या', 'ामधील', 'पुरस्कृत', 'ामधून', 'ांशिवाय', 'च', 'ांतील', 'ांपैकी', 'ेवरील', 'ेबरोबर', 'ॉकमध्ये', 'ेमध्ये', 'ांकडून', 'ेसंबंधी', 
           'ेस', 'ांवर', 'रेटचा', 'ांचे', 'ांनी', 'ेतल्या', 'ॉक', 'ेतली', 'िंगपासून', 'ांची', 'ावर', 'ेतून', 'ेजवळील', 'रेट', 'ेचे', 'र्स', 'ेवर',
           'ेऐवजी', 'ेशी', 'ेने', 'ांपेक्षा', 'ेतही', 'ेमार्फत', 'ांनीही', 'िंगसाठी', 'िंगचा']

len(w10)
lemma = list(set(w10))

len(lemma)
print(lemma)

import csv

### filednames
field_Names = ['removals']

file_a = open('try/removals.csv', 'w')
writer_a = csv.DictWriter(file_a, fieldnames=field_Names)
writer_a.writeheader()

for i in ll:
    row = { 'removals':i}
    writer_a.writerow(row)
