import csv

### filednames
field_Names = ['word','stemed']


file_a = open('try/a.csv', 'w')
writer_a = csv.DictWriter(file_a, fieldnames=field_Names)
writer_a.writeheader()

old = ['ाच', 'ाय',  'ीच', 'ीस', 'ेत', 'ेलं', 'ेला', 'ेली', 'ेले', 'ेलो', 'ेल्या', 'ेल्यांचा', 'ेल्यांची', 'ेल्यांना', 'ोय', '्याची', '्याचे', '्याने', '्यामुळे', '्यावर', '्यासारखं', '्यासारखा', '्यासारखी', '्यासारखे',  'ीचं', 'ीचा', 'ीची', 'ीचे', 'ीच्या', 'ीत', 'ीनंतर', 'ीला', 'ीलाही', 'ीसाठी', 'ीसारखी', 'ीहून', 'लेला', 'लेली', 'लेले', 'लेल्या', 'ल्या','ही', 'ाकडून', 'ाकडे', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाचेच', 'ाच्या', 'ात', 'ातच', 'ातली', 'ातल्या', 'ातसुद्धा', 'ातही', 'ातील', 'ातीलच', 'ातून', 'ानंतर', 'ापासून', 'ापेक्षासुद्धा', 'ामधून', 'ामुळे', 'ाला', 'ावर', 'ाशिवाय', 'ाशी', 'ी', 'ून']
ll =[  'ही', 'ांचा', 'ांची', 'ांचे', 'ांच्या', 'ांतर्गत', 'ांपासून', 'ांबद्दल', 'ांबरोबरच', 'ांमध्ये', 'ांवर', 'ांसंबंधीची', 'ांसाठी', 'ाखाली', 'ाखालील', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातली', 'ातील', 'ातून', 'ानं', 'ानुसार', 'ाने', 'ान्वये', 'ाबरोबर', 'ाबाबत', 'ामुळे', 'ाला', 'ावर', 'ाविषयी', 'ासंबंधातील', 'ासंबंधी', 'ासाठी', 'ासारखी', 'िता', 'ितेच्या', 'ी', 'ीगण', 'ीच', 'ीदेखील', 'ीपदाचा', 'ीपदी', 'ीसुद्धा', 'ीही', 'ी', 'ीचं', 'ीचा', 'ीची', 'ीचे', 'ीच्या', 'ीत', 'ीनंतर', 'ीला', 'ीलाही', 'ीसाठी', 'ीसारखी', 'ीहून','ांच्या', 'ाएवढीच', 'ाचा', 'ाचे', 'ात', 'ातील', 'ाद्वारे', 'लेला', 'लेली', 'लेले', 'लेल्या', 'ल्या','ाकडून', 'ाकडे', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाचेच', 'ाच्या', 'ात', 'ातच', 'ातली', 'ातल्या', 'ातसुद्धा', 'ातही', 'ातील', 'ातीलच', 'ातून', 'ानंतर', 'ापासून', 'ापेक्षासुद्धा', 'ामधून', 'ामुळे', 'ाला', 'ावर', 'ाशिवाय', 'ाशी',  'ून', 'ांखाली', 'ांचा', 'ांची', 'ांचीच', 'ांचे', 'ांच्या', 'ांनी','ांपेक्षा', 'ांवर', 'ांवरून', 'ांहून', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातच', 'ातला', 'ातून', 'ात्मक', 'ानी', 'ाने', 'ापेक्षा', 'ामधे', 'ामध्ये', 'ाला', 'ावर', 'ावरून', 'ाच', 'ाय', 'ी', 'ीच', 'ीस', 'े', 'ेत', 'ेलं', 'ेला', 'ेली', 'ेले', 'ेलो', 'ेल्या', 'ेल्यांचा', 'ेल्यांची', 'ेल्यांना',  'ोय', '्या', '्याची', '्याचे', '्याने', '्यामुळे', '्यावर', '्यासारखं', '्यासारखा', '्यासारखी', '्यासारखे', 'णारी', 'णारे', 'णाऱ्या',   'तात', 'तील',  'तोय', 'लं', 'लंय',  'लात',  'लेला', 'लेली', 'लेले', 'लेल्या','ल्याने', 'ींकडे', 'ींचा', 'ींची', 'ींचे', 'ींच्या', 'ींतील', 'ींतून', 'ींना', 'ींनी', 'ींपासून', 'ींपुढे', 'ींबद्दल', 'ींबाबत', 'ींमुळे', 'ींमुळेच', 'ींवर', 'ीचं', 'ीचा', 'ीची', 'ीचीच', 'ीचे', 'ीचेच', 'ीच्या', 'ीत', 'ीतच', 'ीतून', 'ीनंतर', 'ीमुळे', 'ीला', 'ीवर', 'ीही', 'ांचा', 'ांची', 'ांचे', 'ांच्या', 'ांतर्गत', 'ांपासून', 'ांबद्दल', 'ांबरोबरच', 'ांमध्ये', 'ांवर', 'ांसंबंधीची', 'ांसाठी', 'ाखाली', 'ाखालील', 'ाचं', 'ाचा', 'ाची', 'ाचे', 'ाच्या', 'ात', 'ातली', 'ातील', 'ातून', 'ानं', 'ानुसार', 'ाने', 'ान्वये', 'ाबरोबर', 'ाबाबत', 'ामुळे', 'ाला', 'ावर', 'ाविषयी', 'ासंबंधातील', 'ासंबंधी', 'ासाठी', 'ासारखी', 'िता', 'ितेच्या', 'ीगण', 'ीच', 'ीदेखील', 'ीपदाचा', 'ीपदी', 'ीसुद्धा', 'ीही', ]

removals = ['ींनी', 'ामध्ये', 'ीगण', 'ासंबंधी', 'ाशी', 'ींपुढे', 'ांसंबंधीची', 'ाच', 'लेला', 'ाकडे', 'ींचे', 'ात्मक', 'ांखाली', 'तोय', 'ीवर', 'णाऱ्या', 'ातसुद्धा', 'ाचा', 'ितेच्या', 'णारे', 'ांची', 'ेल्या', 'ांहून', '्याचे', 'ाचेच', 'ांबरोबरच', 'ीस', 'ातून', 'ाविषयी', 'लेले', 'ींना', 'ातच', 'ींचा', 'ामधून', 'ांसाठी', 'ींमुळे', 'ेला', 'ींमुळेच', 'ीची', 'ीहून', 'ासारखी', 'ीत', 'ाय', 'े', 'ल्या', 'ातली', 'ावरून', 'ीही', 'ाचे',  'ीदेखील', 'ीसुद्धा', 'ीसाठी', 'ीपदी', 'लं', 'ान्वये', 'ीनंतर',  'ाच्या', 'ांचा', 'तील', 'ातीलच', 'ाचं', 'ून', 'ाएवढीच', 'ींची', 'ांवरून', '्यासारखी', 'ोय', 'ांचीच', 'ाने', 'ेली', '्यासारखे', 'ाकडून', 'ीसारखी', 'ीचे', 'ीतच', 'ांमध्ये', '्या', 'ीचं', 'ीचा', 'ापेक्षासुद्धा', 'ाबाबत', 'ाची', 'ापेक्षा', 'ाखाली', 'ाबरोबर', 'तात', 'ेलो', 'ीलाही', 'ातही', 'ीला', 'ानं', 'ापासून', 'ानी', '्यासारखा', 'ींवर', '्याने', 'ींतील', 'ासंबंधातील', 'ाद्वारे', 'णारी', 'ात', 'ींतून', 'ींपासून', 'ानुसार', 'ांतर्गत', 'ेलं', 'ांच्या', 'ीच', 'ानंतर', 'ामधे', 'ाला', 'ेल्यांना', 'ींबद्दल', 'ींच्या', 'लंय', 'ेत', '्यावर', 'ींबाबत', 'ांपासून', '्याची', 'ीमुळे', 'लेल्या', 'ाखालील', 'ीच्या', 'ेल्यांचा', 'ामुळे', 'ांपेक्षा', 'ांचे', 'ावर', 'लात', 'ांनी', 'ीचेच', 'लेली', 'ातला', '्यामुळे', 'ातील', 'ांवर', 'ांबद्दल', 'ातल्या', 'िता', 'ीचीच', 'ीतून', 'ल्याने', 'ींकडे', 'ेले', 'ाशिवाय', '्यासारखं', 'ासाठी', 'ेल्यांची']


with open('alpha/a.csv', newline='') as dict_File:
    reader_d = csv.DictReader(dict_File)
    
    for row in reader_d:
        word = row['word']
        stemed = ""

        ### 
        gen = list()
        for i in removals:
            if i in row['word']:
                l = len(row['word'])-len(i)
                stemed = word[0:l]
                gen.append(stemed)

        new_row = {'word':word, 'stemed':gen}
        writer_a.writerow(new_row)
                
                



