#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Dec 24 17:35:28 2018

@author: gaurav gahukar

"""


removals = [
        'ामध्ये' 'ाकडे',  'णारे' 'ांची', 'ेल्या', 'ांहून', '्याचे', 'ाचेच', 'ांबरोबर', 'ातून', 'ाविषयी', 'ींना', 'ातच', 'ींचा', 'ामधून', 'ासाठी' 'ामुळे', 'ेला', 'ाकडून', 
            'लेला','्यासारखी', 'ीसारखी', '्यासारखे', '्यासारखा',  'लेली','ेल्यांची', 'ेतर्फे', 'ामध्ये','ांमध्ये', 'ेबद्दल','ेसंबंधी',  'ॉकमध्ये', 'ेमध्ये',
            'ांतर्फे','ेमार्फत', 'ांकडून','च', 'ाशिवाय','ांबरोबर','ेकडून', 'ांकडे',
   
            'ींनी', 'ामध्ये', 'ासंबंधी', 'ाशी', 'ींपुढे', 'ांसंबंधीची', 'ाच',  'ाकडे', 'ींचे',  'ांखाली', 
            'ीवर', 'णाऱ्या', 'ातसुद्धा', 'ाचा', 'ितेच्या', 'णारे', 'ांची', 'ेल्या', 'ांहून', '्याचे', 'ाचेच', 'ांबरोबरच', 'ातून', 'ाविषयी', 
            'ींना', 'ातच', 'ींचा', 'ामधून', 'ांसाठी', 'ींमुळे', 'ेला', 'ींमुळेच', 'ीची', 'ीहून', 'ासारखी', 'ीत', 'ाय',
             'ातली', 'ावरून', 'ीही', 'ाचे',  'ीदेखील', 'ीसुद्धा', 'ीसाठी', 'ीनंतर',  'ाच्या', 'ांचा', 'तील', 'ातीलच', 
            'ाचं', 'ून', 'ाएवढीच', 'ींची', 'ांवरून', 'ांचीच',  'ेली', 'ाकडून',  'ीचे',
            'ीतच', 'ांमध्ये', '्या', 'ीचं', 'ीचा',  'ाबाबत', 'ाची', 'ापेक्षा', 'ाखाली', 'ाबरोबर', 'तात', 'ेलो', 'ीलाही', 'ातही',
            'ीला', 'ापासून','ींवर', '्याने', 'ींतील', 'ासंबंधातील', 'ाद्वारे',  'ींतून', 'ींपासून', 
            'ानुसार', 'ांतर्गत', 'ेलं', 'ांच्या',  'ानंतर', 'ामधे', 'ाला', 'ेल्यांना', 'ींबद्दल', 'ींच्या',  'ेत', '्यावर', 'ींबाबत',
            'ांपासून', '्याची', 'ीमुळे', 'लेल्या', 'ाखालील', 'ीच्या', 'ेल्यांचा', 'ामुळे', 'ांपेक्षा', 'ांचे', 'ावर', 'लात', 'ांनी', 'ीचेच',
            'ातला', '्यामुळे', 'ातील', 'ांवर', 'ांबद्दल', 'ातल्या', 'ीचीच', 'ीतून', 'ल्याने', 'ींकडे', 'ेले',  '्यासारखं',
            'ासाठी', 'ला', 'िंग', 'िंगसंबंधी', 'ॉकहून', 'ेवरच', 'िंगचे', 'ांमधून', 'ींग', 'ेचं', 'ेचा', 'ेनं', 'ेच्या',  'ेपाशी',
           'ातून', 'ांनाही', 'िंगशी', 'ेकडे', 'ांप्रमाणे',  'ेतील', 'ांना',  'ात', 'ेवरही', 'ांमधील', 
           'ेसारख्या', 'ांतून', 'ांमार्फत', 'ेतलं', 'ा', 'ेसमोरच', 'िंगची', 'िंगमधील', 'ांचा', 'ेकडील', 'िंगच्या', 'ेतच', 'ेत', 
           'ेनेही',  'ेसाठी', 'ेकडूनही', 'ांमधली', 'ांचाही', 'ांत', 'ांशी', 'ांसाठी', 'िंगमध्ये', 'ेची', '्स', 'ेशिवाय', 'िंगपर्यंत', 
           'ांच्या', 'ामधील',  'ामधून', 'ांशिवाय', 'ांतील', 'ांपैकी', 'ेवरील', 'ेबरोबर', 
           'ेस', 'ांवर','ांचे', 'ांनी', 'ेतल्या',  'ेतली', 'िंगपासून', 'ांची', 'ावर', 'ेतून', 'ेजवळील',  'ेवर',
           'ेऐवजी', 'ेशी', 'ेने', 'ांपेक्षा', 'ेतही',  'ांनीही', 'साठी' ,"कडून","कडे"
           ]

################################################################################
STEMS = dict()

for i in removals:
    #print(i)
    l = len(i)
    
    STEMS[i]=l
    

#print(STEMS)    


################################################################################

def get_stem_len(word):
    max_len_of_stem = 0
    for i in STEMS:
        if i in word:
            l = len(i)
            if l > max_len_of_stem:
                max_len_of_stem = l
    
    #print(max_len_of_stem)
    return max_len_of_stem


def get_stem(word):

    max_len_of_stem = get_stem_len(word)
    main_word = word[0:-max_len_of_stem]

    len_of_main_word = len(main_word)
    stem = word[len_of_main_word:]
    return main_word,stem




################################################################################
def main():
    #word = "आईकडून"
    
    word = "आईकडे"
    word = "आईकडून"
    word = 'आईसाठी'
    word = "आईकडून"

    word = input("Enter the word to find its Stem : ")

    word = word.strip()
    
    main_word,stem = get_stem(word)

    print("STEM word present in the Entered word is : ",main_word)
    print("Suffix word Present in theh Entered word is : ",stem)


################################################################################
if __name__ == '__main__':
    main()